"""Модуль с константами для приложения."""
PAGE_SIZE = 6  # Максимальное количество постов на странице.

MIN_COOKING_TIME = 1  # Минимальное время приготовления блюда.
MIN_SUM_INGREDIENT = 1  # Минимальное кол-во ингредиентов для блюда.

MAX_VIEW_LENGTH = 20  # Максимальная длинна символов на предпросмотре блюда.
MAX_LINK_POSTFIX = 20  # Максимальная длина генерируемой ссылки.
MAX_LINK_LENGTH = 255  # Максимальная длина ссылки.
MAX_LENGTH_OF_FIELDS = 150  # Максимальная длина поля.
MAX_LENGTH_TITLE_RECIPE = 255  # Максималая длина заголовка рецепта.

URL = "https://foodgramevans.serveftp.com/s/"  # Редирект на детали рецепта.
